#+TITLE: 进程间通讯
#+AUTHOR: DarkSun
#+CATEGORY: Programming, AUPE
#+DATE: [2015-06-04 周四 10:52]
#+OPTIONS: ^:{}


** pipe函数创建管道
#+BEGIN_SRC C
  #include <unistd.h>

  /*  成功返回0,出错返回-1 */
  int pipe(int* fd);
#+END_SRC
该函数通过参数fd返回两个文件描述符,其中fd[ 0 ]为读而打开,fd[ 1 ]为写而打开, *且fd[ 1 ]的输出为fd[ 0 ]的输入*

单进程中的管道几乎没有任何用处,因为进程内部的数据交换根本不需要通过管道来进行. 通常调用pipe的进程会接着fork一个子进程,并在父进程和子进程两端分别关闭读或写的文件描述符,通过这种方式就能实现父子进程间的通讯了.
#+BEGIN_SRC C :exports both :results drawer
  #include <unistd.h>
  #include <fcntl.h>
  #include <stdio.h>
  #include <sys/wait.h>

  int main()
  {
    int fd[2];
    pipe(fd);

    pid_t pid = fork();
    if(pid >0)                    /* 父进程 */
      {
        printf("parent running\n");
        fflush(stdout);
        close(fd[0]);             /* 关闭读fd,父进程负责发送消息 */
        write(fd[1],"this is a messae from parent\n",255);
        close(fd[1]);
        waitpid(pid,NULL,0);
      }
    else
      {
        printf("child running\n");
        fflush(stdout);
        close(fd[1]);
        if(dup2(fd[0],STDIN_FILENO) != STDIN_FILENO)
          {
            printf("dup2 error\n");
            return -1;
          }
        close(fd[0]);
        if(execl("/bin/echo_from_stdin.sh","/bin/echo_from_stdin.sh",(char*)0) < 0)
          {
            printf("exec echo failed\n");
          }
        /* char s[255+1]=""; */
        /* printf("%s\n",gets(s)); */
      }
    return 0;
  }
#+END_SRC

#+RESULTS:
:RESULTS:
child running
parent running

this is a messae from parent
:END:

** popen/pclose函数
这两个函数用于进程用system运行外部命令,并创建管道与该外部命令子进程进行交流
#+BEGIN_SRC C
  #include <stdio.h>

  /* 若type为"r",则返回连接到cmd标准输出的FILE* */
  /* 若type为"w",则返回连接到cmd标准输入的FILE* */
  FILE* popen(const char* cmd,const char* type);

  /* 关闭标准IO留,等待popen中cmd运行结束,再返回其终止状态,出错则返回-1 */
  int pclose(FILE* fp);
#+END_SRC
+ *popen只能连接到子进程的标准输入或标准输出,而无法通过type="rw"实现同时连接输入和输出*
上面pipe的例子可以改写为:
#+BEGIN_SRC C
  #include <unistd.h>
  #include <fcntl.h>
  #include <stdio.h>
  #include <sys/wait.h>

  int main()
  {
    FILE* fp = popen("/bin/echo_from_stdin.sh","w");
    fputs("message from parent\n",fp);
    pclose(fp);
    return 0;
  }

#+END_SRC

#+RESULTS:
: message from parent

*** 操作消息队列
msgctl函数对消息队列执行队中操作
#+BEGIN_SRC C
  #include <sys/msg.h>

  int msgctl(int queueid,int cmd,struct msgid_ds* buf);
#+END_SRC
其中cmd参数说明了对queueid指定的队列要执行的命令:
+ IPC_SET

  按buf结构中的值,设置与消息队列msqid_ds结构中的下列四个字段:

  - msg_perm.uid

  - msg_perm.gid

  - msg_perm.mode

  - msg_qbytes

  执行该命令的进程,其有效用户ID必须等于msg_perm.cuid或msg_perm.uid或超级用户.

  只有超级用户才能增加msg_qbyes的值

+ IPC_RMID

  删除消息队列中的所有消息.

  执行该命令的进程,其有效用户ID必须等于msg_perm.cuid或msg_perm.uid或超级用户.

+ IPC_STAT 

  取此消息队列的msgid_ds结构,并放在buf所指向的结构中
  #+BEGIN_SRC C :exports both :results drawer
    #include <sys/msg.h>
    #include <sys/ipc.h>

    void show_queue_ds(const struct msqid_ds* queue_ds)
    {
      printf("msg_qnum=%d\n",queue_ds->msg_qnum);
      printf("msg_qbytes=%d\n",queue_ds->msg_qbytes);
      printf("msg_lspid=%d\n",queue_ds->msg_lspid);
      printf("msg_lrpid=%d\n",queue_ds->msg_lrpid);

    }
    int main(int argc, char *argv[])
    {
      int queueid = msgget(IPC_PRIVATE,IPC_CREAT);
      struct msqid_ds queue_ds;
      msgctl(queueid,IPC_STAT,&queue_ds);
      show_queue_ds(&queue_ds);
      return 0;
    }

  #+END_SRC

  #+RESULTS:
  :RESULTS:
  msg_qnum=1630404681
  msg_qbytes=1627419888
  msg_lspid=1628099819
  msg_lrpid=192
  :END:

